tutorial/test_case/box/box_fluid_simulation/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
phases (water air);


water
{
	transportModel   Newtonian;
	nu   [0 2 -1 0 0 0 0 ]   1e-06;
	rho   [1 -3 0 0 0 0 0 ]   1000;
}
air
{
	transportModel   Newtonian;
	nu   [0 2 -1 0 0 0 0 ]   1.48e-05;
	rho   [1 -3 0 0 0 0 0 ]   1;
}
sigma   [1 0 -2 0 0 0 0 ]   0.07;
