tutorial/test_case/box/box_fluid_simulation/0/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0 ];

internalField   uniform 1 ;

boundaryField
{
    top_fluid_surface
    {
        type            inletOutlet;
   inletValue           uniform 0 ;

		value           uniform 0 ;

    }


    bottom_fluid_surface
    {
        type            zeroGradient;

    }

    lateral_surface_4
    {
        type            zeroGradient;

    }

    lateral_surface_3
    {
        type            zeroGradient;

    }

    lateral_surface_2
    {
        type            zeroGradient;

    }

    lateral_surface_1
    {
        type            zeroGradient;

    }
}